[Strings]
app_title=YaToML
col_key=Klíč
col_type=Typ
col_value=Hodnota
column_label=Sloupec
document_label=Dokument
err_cannot_open_file=Soubor se nepodařilo otevřít.
err_cannot_open_for_write=Soubor se nepodařilo otevřít pro zápis.
err_display_internal=Interní chyba při zobrazování souboru:
err_display_unknown=Neznámá interní chyba při zobrazování souboru.
err_incomplete_write=Soubor se nepodařilo zapsat kompletně.
err_save_aborted_verification=Uložení zrušeno: bezpečnostní kontrola selhala. Soubor NEBYL změněn.
err_unexpected_internal=Neočekávaná interní chyba:
err_unknown_parse=Neznámá interní chyba při parsování.
kind_alias=Alias
kind_bool=Bool
kind_datetime=Datum/čas
kind_float=Float
kind_integer=Integer
kind_list=Seznam
kind_map=Mapa
kind_null=Null
kind_string=Řetězec
line_label=Řádek
menu_collapse_all=Sbalit vše
menu_copy_key=Kopírovat klíč
menu_copy_value=Kopírovat hodnotu
menu_edit_value=Upravit F2
menu_expand_all=Rozbalit vše
menu_navigate=Skočit na uzel stromu
menu_save=Uložit    Ctrl+S
msg_parse_error_cannot_save=Tento soubor má chybu parsování a nelze jej uložit.
msg_saved_with_hints=Uloženo, ale s poznámkami:
parse_error_label=Chyba parsování
preview_alias_prefix=[Alias ->
preview_list=[Seznam]
preview_map=[Mapa]
save_failed_suffix=Uložení selhalo
status_unsaved=Neuložené změny
verify_structure_child_count=Nesoulad struktury po úpravě (počet potomků).
verify_structure_doc_count=Nesoulad struktury po úpravě (počet dokumentů).
verify_structure_node_type=Nesoulad struktury po úpravě (typ uzlu).
verify_unexpected_change=Neupravená hodnota se neočekávaně změnila.
verify_value_mismatch=Uložená hodnota neodpovídá očekávané nové hodnotě.
warn_block_scalar=Hodnota vícenásobného textového bloku (|/>) NEBYLA uložena (zatím není podporováno pro tento případ).
warn_could_not_locate=Změněnou hodnotu se nepodařilo bezpečně najít a NEBYLA uložena.
warn_flow_container=Hodnota uvnitř flow struktury ([...]/{...}) NEBYLA uložena (zatím není podporováno pro tento případ).
warn_internal_position_error=Interní chyba pozice u změněné hodnoty — NEULOŽENO.
warn_invalid_datetime_prefix=Neplatná hodnota data '
warn_invalid_datetime_suffix=' NEBYLA uložena (původní hodnota zachována).
warn_no_position=Změněná hodnota bez známé pozice NEBYLA uložena.
warn_unexpected_value=Neočekávaná hodnota NEBYLA uložena (původní hodnota zachována).
warn_verify_failed_prefix=Bezpečnostní kontrola selhala (
warn_verify_failed_suffix=) — NIC nebylo uloženo.
warn_verify_nothing_saved=NIC nebylo uloženo.
warn_verify_original_unparsable=původní není znovu parsovatelný
warn_verify_unparsable=Bezpečnostní kontrola selhala (výsledek již není parsovatelný) —